haskell/Pattern_Matching.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Pattern Matching</title>
<!-- 2016-03-24 Thu 05:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Pattern Matching</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Pattern Matching</a></li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pattern Matching</h2>
<div class="outline-text-2" id="text-1">
<p>
Tuple Constructor
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> norm3D (x<span class="org-haskell-operator">,</span> y<span class="org-haskell-operator">,</span> z) <span class="org-haskell-operator">=</span> sqrt(x<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">+</span> y<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">+</span> z<span class="org-haskell-operator">^</span>2)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">norm3D</span> (33<span class="org-haskell-operator">,</span> 11<span class="org-haskell-operator">,</span> 3)
34.91418050019218
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">norm3D</span> (33<span class="org-haskell-operator">,</span> 1<span class="org-haskell-operator">,</span> 3)
33.15116890850155
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">addVectors</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-constructor">Num</span> a) <span class="org-haskell-operator">=&gt;</span> (a<span class="org-haskell-operator">,</span> a) <span class="org-haskell-operator">-&gt;</span> (a<span class="org-haskell-operator">,</span> a) <span class="org-haskell-operator">-&gt;</span> (a<span class="org-haskell-operator">,</span> a)
<span class="org-haskell-definition">addVectors</span> a b <span class="org-haskell-operator">=</span> (fst a <span class="org-haskell-operator">+</span> fst b<span class="org-haskell-operator">,</span> snd a <span class="org-haskell-operator">+</span> snd b)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">addVectors</span> (8<span class="org-haskell-operator">,</span> 9)(<span class="org-haskell-operator">-</span>10<span class="org-haskell-operator">,</span> 12)
(<span class="org-haskell-operator">-</span>2<span class="org-haskell-operator">,</span>21)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">addv1</span> <span class="org-haskell-operator">=</span> addVectors (1<span class="org-haskell-operator">,</span> 3)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> addv1 <span class="org-haskell-operator">=</span> addVectors (1<span class="org-haskell-operator">,</span> 3)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> addv1 [(12<span class="org-haskell-operator">,</span> 23)<span class="org-haskell-operator">,</span> (45<span class="org-haskell-operator">,</span> 23)<span class="org-haskell-operator">,</span> (6<span class="org-haskell-operator">,</span> 14)]
[(13<span class="org-haskell-operator">,</span>26)<span class="org-haskell-operator">,</span>(46<span class="org-haskell-operator">,</span>26)<span class="org-haskell-operator">,</span>(7<span class="org-haskell-operator">,</span>17)]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">add3Dvectors</span> (x1<span class="org-haskell-operator">,</span> y1<span class="org-haskell-operator">,</span> z1) (x2<span class="org-haskell-operator">,</span> y2<span class="org-haskell-operator">,</span> z2) <span class="org-haskell-operator">=</span> (x1<span class="org-haskell-operator">+</span>x2<span class="org-haskell-operator">,</span> y1<span class="org-haskell-operator">+</span>y2<span class="org-haskell-operator">,</span> z1<span class="org-haskell-operator">+</span>z
<span class="org-haskell-definition">first</span>  (x<span class="org-haskell-operator">,</span> <span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> <span class="org-haskell-keyword">_</span>) <span class="org-haskell-operator">=</span> x
<span class="org-haskell-definition">second</span> (<span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> y<span class="org-haskell-operator">,</span> <span class="org-haskell-keyword">_</span>) <span class="org-haskell-operator">=</span> y
<span class="org-haskell-definition">third</span>  (<span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> <span class="org-haskell-keyword">_</span><span class="org-haskell-operator">,</span> z) <span class="org-haskell-operator">=</span> z

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">first</span> (1<span class="org-haskell-operator">,</span> 2<span class="org-haskell-operator">,</span> 3)
1
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">second</span>  (1<span class="org-haskell-operator">,</span> 2<span class="org-haskell-operator">,</span> 3)
2
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">third</span> (1<span class="org-haskell-operator">,</span> 2<span class="org-haskell-operator">,</span> 3)
3   
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">add3Dvectors</span> (23<span class="org-haskell-operator">,</span> 12<span class="org-haskell-operator">,</span> 233) (10<span class="org-haskell-operator">,</span> 100<span class="org-haskell-operator">,</span> 30)
(33<span class="org-haskell-operator">,</span>112<span class="org-haskell-operator">,</span>263)
</pre>
</div>

<p>
<b>Guarded Equations</b>
</p>

<p>
Absolute Value
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">abs</span> n <span class="org-haskell-operator">|</span> n <span class="org-haskell-operator">&gt;=</span>0 <span class="org-haskell-operator">=</span> n
      <span class="org-haskell-operator">|</span> otherwise <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">-</span>n
</pre>
</div>

<p>
Signum/Sign Function
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Without Pattern Matching</span>
<span class="org-haskell-definition">sign</span> n <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">if</span> n <span class="org-haskell-operator">&lt;</span> 0 <span class="org-haskell-keyword">then</span> <span class="org-haskell-operator">-</span> 1 <span class="org-haskell-keyword">else</span> <span class="org-haskell-keyword">if</span> n <span class="org-haskell-operator">==</span> 0 <span class="org-haskell-keyword">then</span> 0 <span class="org-haskell-keyword">else</span> 1


<span class="org-haskell-definition">sign</span> x <span class="org-haskell-operator">|</span> x <span class="org-haskell-operator">&gt;</span>  0 <span class="org-haskell-operator">=</span>  1
       <span class="org-haskell-operator">|</span> x <span class="org-haskell-operator">==</span> 0 <span class="org-haskell-operator">=</span>  0 
       <span class="org-haskell-operator">|</span> x <span class="org-haskell-operator">&lt;</span>  0 <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">-</span>1

<span class="org-comment-delimiter">--</span><span class="org-comment">--------- OR -----</span>


<span class="org-haskell-definition">sign</span> n <span class="org-haskell-operator">|</span> n <span class="org-haskell-operator">&lt;</span>  0    <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">-</span>1
       <span class="org-haskell-operator">|</span> n <span class="org-haskell-operator">==</span> 0    <span class="org-haskell-operator">=</span> 0
       <span class="org-haskell-operator">|</span> otherwise <span class="org-haskell-operator">=</span> 1


<span class="org-comment-delimiter">--</span><span class="org-comment">------------------</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> sign x <span class="org-haskell-operator">|</span> x <span class="org-haskell-operator">&gt;</span> 0 <span class="org-haskell-operator">=</span> 1 <span class="org-haskell-operator">|</span> x <span class="org-haskell-operator">==</span> 0 <span class="org-haskell-operator">=</span> 0 <span class="org-haskell-operator">|</span> x <span class="org-haskell-operator">&lt;</span> 0 <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">-</span>1


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> sign [<span class="org-haskell-operator">-</span>4<span class="org-haskell-operator">..</span>4]
[<span class="org-haskell-operator">-</span>1<span class="org-haskell-operator">,-</span>1<span class="org-haskell-operator">,-</span>1<span class="org-haskell-operator">,-</span>1<span class="org-haskell-operator">,</span>0<span class="org-haskell-operator">,</span>1<span class="org-haskell-operator">,</span>1<span class="org-haskell-operator">,</span>1<span class="org-haskell-operator">,</span>1]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">f</span> x y <span class="org-haskell-operator">|</span> y <span class="org-haskell-operator">&gt;</span> z  <span class="org-haskell-operator">=</span> x<span class="org-haskell-operator">^^</span>2 <span class="org-haskell-operator">-</span> 10.5
      <span class="org-haskell-operator">|</span> y <span class="org-haskell-operator">==</span> z <span class="org-haskell-operator">=</span> x<span class="org-haskell-operator">+</span>10<span class="org-haskell-operator">*</span>y
      <span class="org-haskell-operator">|</span> y <span class="org-haskell-operator">&lt;</span> z  <span class="org-haskell-operator">=</span> x<span class="org-haskell-operator">/</span>z <span class="org-haskell-operator">+</span> y
      <span class="org-haskell-keyword">where</span> z <span class="org-haskell-operator">=</span> x<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">-</span> 5<span class="org-haskell-operator">*</span>y
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">units</span> angle sym <span class="org-haskell-operator">|</span> sym <span class="org-haskell-operator">==</span> <span class="org-string">"deg"</span> <span class="org-haskell-operator">=</span> angle<span class="org-haskell-operator">*</span>pi<span class="org-haskell-operator">/</span>180.0
                <span class="org-haskell-operator">|</span> sym <span class="org-haskell-operator">==</span> <span class="org-string">"rad"</span> <span class="org-haskell-operator">=</span> angle

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>{
<span class="org-haskell-operator">|</span> <span class="org-haskell-keyword">let</span> units angle sym <span class="org-haskell-operator">|</span> sym <span class="org-haskell-operator">==</span> <span class="org-string">"deg"</span> <span class="org-haskell-operator">=</span> angle<span class="org-haskell-operator">*</span>pi<span class="org-haskell-operator">/</span>180.0
<span class="org-haskell-operator">|</span>                 <span class="org-haskell-operator">|</span> sym <span class="org-haskell-operator">==</span> <span class="org-string">"rad"</span> <span class="org-haskell-operator">=</span> angle
<span class="org-haskell-operator">|</span> 
<span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">:</span>}
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">units</span> 180 <span class="org-string">"deg"</span>
3.141592653589793
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">units</span> pi <span class="org-string">"rad"</span>
3.141592653589793
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">units</span> 90 <span class="org-string">"deg"</span> <span class="org-haskell-operator">==</span> pi<span class="org-haskell-operator">/</span>2
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sin</span>(units 90 <span class="org-string">"deg"</span>)
1.0
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sin</span>(units 1.57 <span class="org-string">"rad"</span>)
0.9999996829318346
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">password</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-constructor">Eq</span> a<span class="org-haskell-operator">,</span> <span class="org-haskell-constructor">Num</span> a) <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-constructor">Char</span>]
<span class="org-haskell-definition">password</span> 3423 <span class="org-haskell-operator">=</span> <span class="org-string">"OK - Safe opened"</span>
<span class="org-haskell-definition">password</span> x    <span class="org-haskell-operator">=</span> <span class="org-string">"Error: Wrong Password pal"</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">password</span> 10
<span class="org-string">"Error: Wrong Password pal"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">password</span> 11
<span class="org-string">"Error: Wrong Password pal"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">password</span> 3423
<span class="org-string">"OK - Safe opened"</span>
<span class="org-haskell-operator">&gt;</span> s
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">sayMe</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-constructor">Integral</span> a) <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-constructor">Char</span>]
<span class="org-haskell-definition">sayMe</span> 1 <span class="org-haskell-operator">=</span> <span class="org-string">"One!"</span>  
<span class="org-haskell-definition">sayMe</span> 2 <span class="org-haskell-operator">=</span> <span class="org-string">"Two!"</span>  
<span class="org-haskell-definition">sayMe</span> 3 <span class="org-haskell-operator">=</span> <span class="org-string">"Three!"</span>  
<span class="org-haskell-definition">sayMe</span> 4 <span class="org-haskell-operator">=</span> <span class="org-string">"Four!"</span>  
<span class="org-haskell-definition">sayMe</span> 5 <span class="org-haskell-operator">=</span> <span class="org-string">"Five!"</span>  
<span class="org-haskell-definition">sayMe</span> x <span class="org-haskell-operator">=</span> <span class="org-string">"Not between 1 and 5"</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> sayMe [1<span class="org-haskell-operator">..</span>8]
[<span class="org-string">"One!"</span><span class="org-haskell-operator">,</span><span class="org-string">"Two!"</span><span class="org-haskell-operator">,</span><span class="org-string">"Three!"</span><span class="org-haskell-operator">,</span><span class="org-string">"Four!"</span><span class="org-haskell-operator">,</span><span class="org-string">"Five!"</span><span class="org-haskell-operator">,</span><span class="org-string">"Not between 1 and 5"</span><span class="org-haskell-operator">,</span> <span class="org-string">"Not between 1 and 5"</span><span class="org-haskell-operator">,</span><span class="org-string">"Not between 1 and 5"</span>]
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues</p>
<p class="date">Created: 2016-03-24 Thu 05:53</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>